---
kind: method
id: M:Autodesk.Revit.DB.PointOnPlane.GetPlaneReference
source: html/350a732d-2bf3-800e-8548-6f3ef59a3392.htm
---
# Autodesk.Revit.DB.PointOnPlane.GetPlaneReference Method

The geometric plane reference.

## Syntax (C#)
```csharp
public Reference GetPlaneReference()
```

## Returns
A copy of the reference stored in the PointOnPlane object.